//Створити базовий клас «Продукт» з полями: назва, дата випуску,
//термін використання, пропонована ціна за одиницю товару. Визначити методи,
//що дозволять змінювати значення полів, віртуальний метод для аналізу
//годності товару. Створити породжений клас «Молочний продукт» з
//додатковими полями: назва виробника, масова частка молока.
//Ієрархія класів: службовець, особа, робітник, інженер. Варіант запиту:
//кількість співробітників зі стажем щонайменше заданого, відсортованих у
//порядку зростання стажу роботи.
namespace LabaOOP6
{
    internal class Program
    {
       
        static void Main(string[] args)
        {
         //   Employee[] employees = new Employee[]
         //{
         //   new Worker("Alice", new DateTime(1990, 5, 1), new DateTime(2015, 6, 1)),
         //   new Engineer("Bob", new DateTime(1985, 8, 12), new DateTime(2010, 2, 1)),
         //   new Worker("Charlie", new DateTime(1980, 11, 22), new DateTime(2005, 1, 1)),
         //   new Engineer("Diana", new DateTime(1992, 7, 7), new DateTime(2018, 4, 1)),
         //};
          

        }
    }
}
